ArduPilot/ardupilot/modules/CrashDebug/mri/devices/lpc43xx/lpc43xx_uart.c
/* Copyright 2016 Adam Green (http://mbed.org/users/AdamGreen/)

   Licensed under the Apache License, Version 2.0 (the "License");
   you may not use this file except in compliance with the License.
   You may obtain a copy of the License at

       http://www.apache.org/licenses/LICENSE-2.0

   Unless required by applicable law or agreed to in writing, software
   distributed under the License is distributed on an "AS IS" BASIS,
   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
   See the License for the specific language governing permissions and
   limitations under the License.
*/
/* Routines used to provide LPC43xx UART functionality to the mri debugger. */
#include <string.h>
#include <stdlib.h>
#include "platforms.h"
#include "../../architectures/armv7-m/debug_cm3.h"
#include "lpc43xx_init.h"


static const UartConfiguration g_uartConfigurations[] =
{
    {
        LPC_USART0,
        CLK_BASE_UART0,
        CLK_MX_UART0,
        CLK_APB0_UART0,
        SCU_PIN(6, 4),
        SCU_MODE_FUNC2,
        SCU_PIN(6, 5),
        SCU_MODE_FUNC2
    },
    {
        LPC_UART1,
        CLK_BASE_UART1,
        CLK_MX_UART1,
        CLK_APB0_UART1,
        SCU_PIN(5, 6),
        SCU_MODE_FUNC4,
        SCU_PIN(1, 14),
        SCU_MODE_FUNC1
    },
    {
        LPC_USART2,
        CLK_BASE_UART2,
        CLK_MX_UART2,
        CLK_APB2_UART2,
        SCU_PIN(2, 10),
        SCU_MODE_FUNC2,
        SCU_PIN(2, 11),
        SCU_MODE_FUNC2
    },
    {
        LPC_USART3,
        CLK_BASE_UART3,
        CLK_MX_UART3,
        CLK_APB2_UART3,
        SCU_PIN(2, 3),
        SCU_MODE_FUNC2,
        SCU_PIN(2, 4),
        SCU_MODE_FUNC2
    }
};

static UartConfiguration g_customUart;

typedef struct
{
    const UartConfiguration* pUart;
    int                      share;
    uint32_t                 baudRate;
} UartParameters;

typedef struct
{
    uint32_t    integerBaudRateDivisor;
    uint32_t    fractionalBaudRateDivisor;
} BaudRateDivisors;

typedef struct
{
    uint32_t    desiredRatio;
    uint32_t    mul;
    uint32_t    divAdd;
    uint32_t    closestDivisor;
    uint32_t    closestMul;
    uint32_t    closestDivAdd;
    uint32_t    closestDelta;
} CalculateDivisors;



static void     parseUartParameters(Token* pParameterTokens, UartConfiguration* pUart, UartParameters* pParameters);
static void     saveUartToBeUsedByDebugger(const UartConfiguration* pUart);
static void     setUartSharedFlag(void);
static uint32_t uint32FromString(const char* pString);
static uint32_t getDecimalDigit(char currChar);
static void     configureUartForExclusiveUseOfDebugger(UartParameters* pParameters);
static void     setUartPeripheralClockToPLL1(void);
static void     enableUartClocks(void);
static void     enableCCUClock(CCU_CLK_T clockToEnable);
static void     clearUartFractionalBaudDivisor(void);
static void     enableUartFifoAndDisableDma(void);
static void     setUartTo8N1(void);
static void     setUartBaudRate(UartParameters* pParameters);
static void     setDivisors(BaudRateDivisors* pDivisors);
static void     setDivisorLatchBit(void);
static void     clearDivisorLatchBit(void);
static void     setManualBaudFlag(void);
static BaudRateDivisors calculateBaudRateDivisors(uint32_t baudRate, uint32_t peripheralRate);
static void     initCalculateDivisorsStruct(CalculateDivisors* pThis, uint32_t baudRate, uint32_t peripheralRate);
static uint32_t fixupPeripheralRateFor16XOversampling(uint32_t actualPeripheralRate);
static int      isNoFractionalDivisorRequired(CalculateDivisors* pThis);
static BaudRateDivisors closestDivisors(CalculateDivisors* pThis);
static BaudRateDivisors calculateFractionalBaudRateDivisors(CalculateDivisors* pThis);
static void     checkTheseFractionalDivisors(CalculateDivisors* pThis);
static void     selectUartPins(void);
static void     enableUartToInterruptOnReceivedChar(void);
static void     configureNVICForUartInterrupt(void);
void __mriLpc43xxUart_Init(Token* pParameterTokens)
{
    UartParameters    parameters = {NULL, 0, 0};

    parseUartParameters(pParameterTokens, &g_customUart, &parameters);
    saveUartToBeUsedByDebugger(parameters.pUart);
    if (parameters.share)
        setUartSharedFlag();
    else
        configureUartForExclusiveUseOfDebugger(&parameters);
}

static void parseUartParameters(Token* pParameterTokens, UartConfiguration* pUart, UartParameters* pParameters)
{
    static const char baudRatePrefix[] = "MRI_UART_BAUD=";
    const char*       pMatchingPrefix = NULL;
    LPC_USART_T*      pRxUartRegisters = NULL;

    /* Parse TX pins */
    if (Token_MatchingString(pParameterTokens, "MRI_UART_TX_P1_13"))
    {
        /* {P1_13, UART_1, (SCU_PINIO_UART_TX | 1)}, */
        pUart->pUartRegisters = LPC_UART1;
        pUart->txPin = SCU_PIN(1, 13);
        pUart->txFunction = SCU_MODE_FUNC1;
    }
    if (Token_MatchingString(pParameterTokens, "MRI_UART_TX_P1_15"))
    {
        /* {P1_15, UART_2, (SCU_PINIO_UART_TX | 1)}, */
        pUart->pUartRegisters = LPC_USART2;
        pUart->txPin = SCU_PIN(1, 15);
        pUart->txFunction = SCU_MODE_FUNC1;
    }
    if (Token_MatchingString(pParameterTokens, "MRI_UART_TX_P2_0"))
    {
        /* {P2_0,  UART_0, (SCU_PINIO_UART_TX | 1)}, */
        pUart->pUartRegisters = LPC_USART0;
        pUart->txPin = SCU_PIN(2, 0);
        pUart->txFunction = SCU_MODE_FUNC1;
    }
    if (Token_MatchingString(pParameterTokens, "MRI_UART_TX_P2_3"))
    {
        /* {P2_3,  UART_3, (SCU_PINIO_UART_TX | 2)}, */
        pUart->pUartRegisters = LPC_USART3;
        pUart->txPin = SCU_PIN(2, 3);
        pUart->txFunction = SCU_MODE_FUNC2;
    }
    if (Token_MatchingString(pParameterTokens, "MRI_UART_TX_P2_10"))
    {
        /* {P2_10, UART_2, (SCU_PINIO_UART_TX | 2)}, */
        pUart->pUartRegisters = LPC_USART2;
        pUart->txPin = SCU_PIN(2, 10);
        pUart->txFunction = SCU_MODE_FUNC2;
    }
    if (Token_MatchingString(pParameterTokens, "MRI_UART_TX_P3_4"))
    {
        /* {P3_4,  UART_1, (SCU_PINIO_UART_TX | 4)}, */
        pUart->pUartRegisters = LPC_UART1;
        pUart->txPin = SCU_PIN(3, 4);
        pUart->txFunction = SCU_MODE_FUNC4;
    }
    if (Token_MatchingString(pParameterTokens, "MRI_UART_TX_P4_1"))
    {
        /* {P4_1,  UART_3, (SCU_PINIO_UART_TX | 6)}, */
        pUart->pUartRegisters = LPC_USART3;
        pUart->txPin = SCU_PIN(4, 1);
        pUart->txFunction = SCU_MODE_FUNC6;
    }
    if (Token_MatchingString(pParameterTokens, "MRI_UART_TX_P5_6"))
    {
        /* {P5_6,  UART_1, (SCU_PINIO_UART_TX | 4)}, */
        pUart->pUartRegisters = LPC_UART1;
        pUart->txPin = SCU_PIN(5, 6);
        pUart->txFunction = SCU_MODE_FUNC4;
    }
    if (Token_MatchingString(pParameterTokens, "MRI_UART_TX_P6_4"))
    {
        /* {P6_4,  UART_0, (SCU_PINIO_UART_TX | 2)}, */
        pUart->pUartRegisters = LPC_USART0;
        pUart->txPin = SCU_PIN(6, 4);
        pUart->txFunction = SCU_MODE_FUNC2;
    }
    if (Token_MatchingString(pParameterTokens, "MRI_UART_TX_P7_1"))
    {
        /* {P7_1,  UART_2, (SCU_PINIO_UART_TX | 6)}, */
        pUart->pUartRegisters = LPC_USART2;
        pUart->txPin = SCU_PIN(7, 1);
        pUart->txFunction = SCU_MODE_FUNC6;
    }
    if (Token_MatchingString(pParameterTokens, "MRI_UART_TX_P9_3"))
    {
        /* {P9_3,  UART_3, (SCU_PINIO_UART_TX | 7)}, */
        pUart->pUartRegisters = LPC_USART3;
        pUart->txPin = SCU_PIN(9, 3);
        pUart->txFunction = SCU_MODE_FUNC7;
    }
    if (Token_MatchingString(pParameterTokens, "MRI_UART_TX_P9_5"))
    {
        /* {P9_5,  UART_0, (SCU_PINIO_UART_TX | 7)}, */
        pUart->pUartRegisters = LPC_USART0;
        pUart->txPin = SCU_PIN(9, 5);
        pUart->txFunction = SCU_MODE_FUNC7;
    }
    if (Token_MatchingString(pParameterTokens, "MRI_UART_TX_PA_1"))
    {
        /* {PA_1,  UART_2, (SCU_PINIO_UART_TX | 3)}, */
        pUart->pUartRegisters = LPC_USART2;
        pUart->txPin = SCU_PIN(0xA, 1);
        pUart->txFunction = SCU_MODE_FUNC3;
    }
    if (Token_MatchingString(pParameterTokens, "MRI_UART_TX_PC_13"))
    {
        /* {PC_13, UART_1, (SCU_PINIO_UART_TX | 2)}, */
        pUart->pUartRegisters = LPC_UART1;
        pUart->txPin = SCU_PIN(0xC, 13);
        pUart->txFunction = SCU_MODE_FUNC2;
    }
    if (Token_MatchingString(pParameterTokens, "MRI_UART_TX_PE_11"))
    {
        /* {PE_11, UART_1, (SCU_PINIO_UART_TX | 2)}, */
        pUart->pUartRegisters = LPC_UART1;
        pUart->txPin = SCU_PIN(0xE, 11);
        pUart->txFunction = SCU_MODE_FUNC2;
    }
    if (Token_MatchingString(pParameterTokens, "MRI_UART_TX_PF_2"))
    {
        /* {PF_2,  UART_3, (SCU_PINIO_UART_TX | 1)}, */
        pUart->pUartRegisters = LPC_USART3;
        pUart->txPin = SCU_PIN(0xF, 2);
        pUart->txFunction = SCU_MODE_FUNC1;
    }
    if (Token_MatchingString(pParameterTokens, "MRI_UART_TX_PF_10"))
    {
        /* {PF_10, UART_0, (SCU_PINIO_UART_TX | 1)}, */
        pUart->pUartRegisters = LPC_USART0;
        pUart->txPin = SCU_PIN(0xF, 10);
        pUart->txFunction = SCU_MODE_FUNC1;
    }


    /* Parse RX pins */
    if (Token_MatchingString(pParameterTokens, "MRI_UART_RX_P1_14"))
    {
        /* {P1_14, UART_1, (SCU_PINIO_UART_RX | 1)}, */
        pRxUartRegisters = LPC_UART1;
        pUart->rxPin = SCU_PIN(1, 14);
        pUart->rxFunction = SCU_MODE_FUNC1;
    }
    if (Token_MatchingString(pParameterTokens, "MRI_UART_RX_P1_16"))
    {
        /* {P1_16, UART_2, (SCU_PINIO_UART_RX | 1)}, */
        pRxUartRegisters = LPC_USART2;
        pUart->rxPin = SCU_PIN(1, 16);
        pUart->rxFunction = SCU_MODE_FUNC1;
    }
    if (Token_MatchingString(pParameterTokens, "MRI_UART_RX_P2_1"))
    {
        /* {P2_1,  UART_0, (SCU_PINIO_UART_RX | 1)}, */
        pRxUartRegisters = LPC_USART0;
        pUart->rxPin = SCU_PIN(2, 1);
        pUart->rxFunction = SCU_MODE_FUNC1;
    }
    if (Token_MatchingString(pParameterTokens, "MRI_UART_RX_P2_4"))
    {
        /* {P2_4,  UART_3, (SCU_PINIO_UART_RX | 2)}, */
        pRxUartRegisters = LPC_USART3;
        pUart->rxPin = SCU_PIN(2, 4);
        pUart->rxFunction = SCU_MODE_FUNC2;
    }
    if (Token_MatchingString(pParameterTokens, "MRI_UART_RX_P2_11"))
    {
        /* {P2_11, UART_2, (SCU_PINIO_UART_RX | 2)}, */
        pRxUartRegisters = LPC_USART2;
        pUart->rxPin = SCU_PIN(2, 11);
        pUart->rxFunction = SCU_MODE_FUNC2;
    }
    if (Token_MatchingString(pParameterTokens, "MRI_UART_RX_P3_5"))
    {
        /* {P3_5,  UART_1, (SCU_PINIO_UART_RX | 4)}, */
        pRxUartRegisters = LPC_UART1;
        pUart->rxPin = SCU_PIN(3, 5);
        pUart->rxFunction = SCU_MODE_FUNC4;
    }
    if (Token_MatchingString(pParameterTokens, "MRI_UART_RX_P4_2"))
    {
        /* {P4_2,  UART_3, (SCU_PINIO_UART_RX | 6)}, */
        pRxUartRegisters = LPC_USART3;
        pUart->rxPin = SCU_PIN(4, 2);
        pUart->rxFunction = SCU_MODE_FUNC6;
    }
    if (Token_MatchingString(pParameterTokens, "MRI_UART_RX_P5_7"))
    {
        /* {P5_7,  UART_1, (SCU_PINIO_UART_RX | 4)}, */
        pRxUartRegisters = LPC_UART1;
        pUart->rxPin = SCU_PIN(5, 7);
        pUart->rxFunction = SCU_MODE_FUNC4;
    }
    if (Token_MatchingString(pParameterTokens, "MRI_UART_RX_P6_5"))
    {
        /* {P6_5,  UART_0, (SCU_PINIO_UART_RX | 2)}, */
        pRxUartRegisters = LPC_USART0;
        pUart->rxPin = SCU_PIN(6, 5);
        pUart->rxFunction = SCU_MODE_FUNC2;
    }
    if (Token_MatchingString(pParameterTokens, "MRI_UART_RX_P7_2"))
    {
        /* {P7_2,  UART_2, (SCU_PINIO_UART_RX | 6)}, */
        pRxUartRegisters = LPC_USART2;
        pUart->rxPin = SCU_PIN(7, 2);
        pUart->rxFunction = SCU_MODE_FUNC6;
    }
    if (Token_MatchingString(pParameterTokens, "MRI_UART_RX_P9_4"))
    {
        /* {P9_4,  UART_3, (SCU_PINIO_UART_RX | 7)}, */
        pRxUartRegisters = LPC_USART3;
        pUart->rxPin = SCU_PIN(9, 4);
        pUart->rxFunction = SCU_MODE_FUNC7;
    }
    if (Token_MatchingString(pParameterTokens, "MRI_UART_RX_P9_6"))
    {
        /* {P9_6,  UART_0, (SCU_PINIO_UART_RX | 7)}, */
        pRxUartRegisters = LPC_USART0;
        pUart->rxPin = SCU_PIN(9, 6);
        pUart->rxFunction = SCU_MODE_FUNC7;
    }
    if (Token_MatchingString(pParameterTokens, "MRI_UART_RX_PA_2"))
    {
        /* {PA_2,  UART_2, (SCU_PINIO_UART_RX | 3)}, */
        pRxUartRegisters = LPC_USART2;
        pUart->rxPin = SCU_PIN(0xA, 2);
        pUart->rxFunction = SCU_MODE_FUNC3;
    }
    if (Token_MatchingString(pParameterTokens, "MRI_UART_RX_PC_14"))
    {
        /* {PC_14, UART_1, (SCU_PINIO_UART_RX | 2)}, */
        pRxUartRegisters = LPC_UART1;
        pUart->rxPin = SCU_PIN(0xC, 14);
        pUart->rxFunction = SCU_MODE_FUNC2;
    }
    if (Token_MatchingString(pParameterTokens, "MRI_UART_RX_PE_12"))
    {
        /* {PE_12, UART_1, (SCU_PINIO_UART_RX | 2)}, */
        pRxUartRegisters = LPC_UART1;
        pUart->rxPin = SCU_PIN(0xE, 12);
        pUart->rxFunction = SCU_MODE_FUNC2;
    }
    if (Token_MatchingString(pParameterTokens, "MRI_UART_RX_PF_3"))
    {
        /* {PF_3,  UART_3, (SCU_PINIO_UART_RX | 1)}, */
        pRxUartRegisters = LPC_USART3;
        pUart->rxPin = SCU_PIN(0xF, 3);
        pUart->rxFunction = SCU_MODE_FUNC1;
    }
    if (Token_MatchingString(pParameterTokens, "MRI_UART_RX_PF_11"))
    {
        /* {PF_11, UART_0, (SCU_PINIO_UART_RX | 1)}, */
        pRxUartRegisters = LPC_USART0;
        pUart->rxPin = SCU_PIN(0xF, 11);
        pUart->rxFunction = SCU_MODE_FUNC1;
    }

