ArduPilot/ardupilot/modules/CrashDebug/mri/devices/lpc43xx/lpc43xx_uart.c
    /* Remember this UART if Tx and Rx pin matched to the same UART peripherals. */
    if (pUart->pUartRegisters == pRxUartRegisters)
        pParameters->pUart = pUart;

    /* The Bambino210E only exposes a single set of pins per UART so these are specific to that board. */
    if (Token_MatchingString(pParameterTokens, "MRI_UART_MBED_USB"))
        pParameters->pUart = &g_uartConfigurations[2];
    if (Token_MatchingString(pParameterTokens, "MRI_UART_0"))
        pParameters->pUart = &g_uartConfigurations[0];
    if (Token_MatchingString(pParameterTokens, "MRI_UART_1"))
        pParameters->pUart = &g_uartConfigurations[1];
    if (Token_MatchingString(pParameterTokens, "MRI_UART_2"))
        pParameters->pUart = &g_uartConfigurations[2];
    if (Token_MatchingString(pParameterTokens, "MRI_UART_3"))
        pParameters->pUart = &g_uartConfigurations[3];

    /* Default to MRI_UART_MBED_USB if nothing else was specified. */
    if (!pParameters->pUart)
        pParameters->pUart = &g_uartConfigurations[2];

    if ((pMatchingPrefix = Token_MatchingStringPrefix(pParameterTokens, baudRatePrefix)) != NULL)
        pParameters->baudRate = uint32FromString(pMatchingPrefix + sizeof(baudRatePrefix)-1);

    if (Token_MatchingString(pParameterTokens, "MRI_UART_SHARE"))
        pParameters->share = 1;
}

static void saveUartToBeUsedByDebugger(const UartConfiguration* pUart)
{
    __mriLpc43xxState.pCurrentUart = pUart;
}

static void setUartSharedFlag(void)
{
    __mriLpc43xxState.flags |= LPC43XX_UART_FLAGS_SHARE;
}

static uint32_t uint32FromString(const char* pString)
{
    uint32_t value = 0;

    while (*pString)
    {
        uint32_t digit;

        __try
        {
            digit = getDecimalDigit(*pString++);
        }
        __catch
        {
            clearExceptionCode();
            break;
        }

        value = value * 10 + digit;
    }

    return value;
}

static uint32_t getDecimalDigit(char currChar)
{
    if (currChar >= '0' && currChar <= '9')
        return currChar - '0';
    else
        __throw_and_return(invalidDecDigitException, 0);
}

static void configureUartForExclusiveUseOfDebugger(UartParameters* pParameters)
{
    setUartPeripheralClockToPLL1();
    enableUartClocks();
    clearUartFractionalBaudDivisor();
    enableUartFifoAndDisableDma();
    setUartTo8N1();
    setUartBaudRate(pParameters);
    selectUartPins();
    enableUartToInterruptOnReceivedChar();
    Platform_CommPrepareToWaitForGdbConnection();
    configureNVICForUartInterrupt();
}

static void setUartPeripheralClockToPLL1(void)
{
    static const uint32_t autoBlockBit = 1 << 11;
    static const uint32_t pll1Bit = 0x09 << 24;

    LPC_CGU->BASE_CLK[__mriLpc43xxState.pCurrentUart->baseClock] = autoBlockBit | pll1Bit;
}

static void enableUartClocks(void)
{
    enableCCUClock(__mriLpc43xxState.pCurrentUart->registerClock);
    enableCCUClock(__mriLpc43xxState.pCurrentUart->peripheralClock);
}

static void enableCCUClock(CCU_CLK_T clockToEnable)
{
    static const uint32_t runBit = 1 << 0;

    if (clockToEnable < CLK_CCU2_START)
        LPC_CCU1->CLKCCU[clockToEnable].CFG = runBit;
    else
        LPC_CCU2->CLKCCU[clockToEnable - CLK_CCU2_START].CFG = runBit;
}

static void clearUartFractionalBaudDivisor(void)
{
    __mriLpc43xxState.pCurrentUart->pUartRegisters->FDR = 0x10;
}

static void enableUartFifoAndDisableDma(void)
{
    static const uint32_t enableFifoDisableDmaSetReceiveInterruptThresholdTo0 = 0x01;

    __mriLpc43xxState.pCurrentUart->pUartRegisters->FCR = enableFifoDisableDmaSetReceiveInterruptThresholdTo0;
}

static void setUartTo8N1(void)
{
    static const uint8_t wordLength8Bit = 0x3;
    static const uint8_t stopBit1 = 0 << 2;
    static const uint8_t disableParity = 0 << 3;
    static const uint8_t lineControlValueFor8N1 = wordLength8Bit | disableParity | stopBit1;

    __mriLpc43xxState.pCurrentUart->pUartRegisters->LCR = lineControlValueFor8N1;
}

static void setUartBaudRate(UartParameters* pParameters)
{
    BaudRateDivisors  divisors;

    if (pParameters->baudRate == 0)
        return;

    divisors = calculateBaudRateDivisors(pParameters->baudRate, SystemCoreClock);
    setDivisors(&divisors);
    setManualBaudFlag();
}

static BaudRateDivisors calculateBaudRateDivisors(uint32_t baudRate, uint32_t peripheralRate)
{
    CalculateDivisors   calcDivisors;

    initCalculateDivisorsStruct(&calcDivisors, baudRate, peripheralRate);
    if (isNoFractionalDivisorRequired(&calcDivisors))
        return closestDivisors(&calcDivisors);
    return calculateFractionalBaudRateDivisors(&calcDivisors);
}

static void initCalculateDivisorsStruct(CalculateDivisors* pThis, uint32_t baudRate, uint32_t peripheralRate)
{
    /* Calculate desired clock to baud ratio in 17.15 fixed format.
       This code can handle peripheralRates which are less <512MHz since
         2^29 / 16 = 2^29 / 2^4 = 2^25 and (2^25 << 7) fits in 32-bit value.
       If you divide by a low baud rate like 300 (>2^8) then mantissa only needs 25 - 8 = 17 bits. */
    pThis->desiredRatio = ((fixupPeripheralRateFor16XOversampling(peripheralRate) << 7) / baudRate) << 8;
    pThis->mul = 1;
    pThis->divAdd = 0;
    pThis->closestDelta = ~0U;
    pThis->closestDivisor = pThis->desiredRatio >> 15;
    pThis->closestMul = 1;
    pThis->closestDivAdd = 0;
}

static uint32_t fixupPeripheralRateFor16XOversampling(uint32_t actualPeripheralRate)
{
    return actualPeripheralRate / 16;
}

static int isNoFractionalDivisorRequired(CalculateDivisors* pThis)
{
    /* Check for no fractional bits in the 17.15 fixed format. */
    return (pThis->desiredRatio & 0x7FFF) == 0;
}

static BaudRateDivisors closestDivisors(CalculateDivisors* pThis)
{
    BaudRateDivisors divisors;

    divisors.integerBaudRateDivisor = pThis->closestDivisor;
    divisors.fractionalBaudRateDivisor = (pThis->closestMul << 4) | pThis->closestDivAdd;

    return divisors;
}

static BaudRateDivisors calculateFractionalBaudRateDivisors(CalculateDivisors* pThis)
{
    for (pThis->mul = 1 ; pThis->mul <= 15 ; pThis->mul++)
    {
        for (pThis->divAdd = 1 ; pThis->divAdd < pThis->mul ; pThis->divAdd++)
            checkTheseFractionalDivisors(pThis);
    }
    return closestDivisors(pThis);
}

static void checkTheseFractionalDivisors(CalculateDivisors* pThis)
{
    static const uint32_t fixedOne = (1 << 15);
    uint32_t              fixedScale;
    uint32_t              testDivisor;
    uint32_t              fixedRatio;
    uint32_t              fixedDelta;

    fixedScale = fixedOne + ((pThis->divAdd << 15) / pThis->mul);
    testDivisor = pThis->desiredRatio / fixedScale;
    fixedRatio = testDivisor * fixedScale;
    fixedDelta = abs(fixedRatio - pThis->desiredRatio);

    if (fixedDelta < pThis->closestDelta)
    {
        pThis->closestDelta = fixedDelta;
        pThis->closestDivisor = testDivisor;
        pThis->closestMul = pThis->mul;
        pThis->closestDivAdd = pThis->divAdd;
    }
}

static void setDivisors(BaudRateDivisors* pDivisors)
{
    LPC_USART_T* pUartRegisters = __mriLpc43xxState.pCurrentUart->pUartRegisters;

    setDivisorLatchBit();

    pUartRegisters->DLL = pDivisors->integerBaudRateDivisor & 0xFF;
    pUartRegisters->DLM = pDivisors->integerBaudRateDivisor >> 8;
    pUartRegisters->FDR = pDivisors->fractionalBaudRateDivisor;

    clearDivisorLatchBit();
}

#define LPC176x_UART_LCR_DLAB (1 << 7)

static void setDivisorLatchBit(void)
{
    __mriLpc43xxState.pCurrentUart->pUartRegisters->LCR |= LPC176x_UART_LCR_DLAB;
}

