ArduPilot/ardupilot/modules/CrashDebug/mri/devices/lpc43xx/lpc43xx_uart.c
static void clearDivisorLatchBit(void)
{
    __mriLpc43xxState.pCurrentUart->pUartRegisters->LCR &= ~LPC176x_UART_LCR_DLAB;
}

static void setManualBaudFlag(void)
{
    __mriLpc43xxState.flags |= LPC43XX_UART_FLAGS_MANUAL_BAUD;

}

static void selectUartPins(void)
{
    const UartConfiguration*  pUart = __mriLpc43xxState.pCurrentUart;
    uint32_t                  txPin = pUart->txPin;
    uint32_t                  rxPin = pUart->rxPin;

    LPC_SCU->SFSP[txPin >> 16][txPin & 0xFFFF] = pUart->txFunction;
    LPC_SCU->SFSP[rxPin >> 16][rxPin & 0xFFFF] = pUart->rxFunction | SCU_PINIO_PULLNONE;
}

static void enableUartToInterruptOnReceivedChar(void)
{
    static const uint32_t baudDivisorLatchBit = (1 << 7);
    static const uint32_t enableReceiveDataInterrupt = (1 << 0);
    uint32_t              originalLCR;

    originalLCR = __mriLpc43xxState.pCurrentUart->pUartRegisters->LCR;
    __mriLpc43xxState.pCurrentUart->pUartRegisters->LCR &= ~baudDivisorLatchBit;
    __mriLpc43xxState.pCurrentUart->pUartRegisters->IER = enableReceiveDataInterrupt;
    __mriLpc43xxState.pCurrentUart->pUartRegisters->LCR = originalLCR;
}

static void configureNVICForUartInterrupt(void)
{
    IRQn_Type uart0BaseIRQ = USART0_IRQn;
    IRQn_Type currentUartIRQ;

    currentUartIRQ = (IRQn_Type)((int)uart0BaseIRQ + Platform_CommUartIndex());
    NVIC_SetPriority(currentUartIRQ, 0);
    NVIC_EnableIRQ(currentUartIRQ);
}


int Platform_CommUartIndex(void)
{
    if (__mriLpc43xxState.pCurrentUart->pUartRegisters == LPC_USART0)
        return 0;
    else if (__mriLpc43xxState.pCurrentUart->pUartRegisters == LPC_UART1)
        return 1;
    else if (__mriLpc43xxState.pCurrentUart->pUartRegisters == LPC_USART2)
        return 2;
    else if (__mriLpc43xxState.pCurrentUart->pUartRegisters == LPC_USART3)
        return 3;
    else
        return -1;
}


uint32_t Platform_CommHasReceiveData(void)
{
    static const uint8_t receiverDataReadyBit = 1 << 0;

    return __mriLpc43xxState.pCurrentUart->pUartRegisters->LSR & receiverDataReadyBit;
}


static void     waitForUartToReceiveData(void);
int Platform_CommReceiveChar(void)
{
    waitForUartToReceiveData();

    return (int)__mriLpc43xxState.pCurrentUart->pUartRegisters->RBR;
}

static void waitForUartToReceiveData(void)
{
    while (!Platform_CommHasReceiveData())
    {
    }
}

static void     waitForUartToAllowTransmit(void);
static uint32_t targetUartCanTransmit(void);
void Platform_CommSendChar(int Character)
{
    waitForUartToAllowTransmit();

    __mriLpc43xxState.pCurrentUart->pUartRegisters->THR = (uint8_t)Character;
}

static void waitForUartToAllowTransmit(void)
{
    while (!targetUartCanTransmit())
    {
    }
}

static uint32_t targetUartCanTransmit(void)
{
    static const uint8_t transmitterHoldRegisterEmptyBit = 1 << 5;

    return __mriLpc43xxState.pCurrentUart->pUartRegisters->LSR & transmitterHoldRegisterEmptyBit;
}


int Platform_CommCausedInterrupt(void)
{
    const uint32_t uart0BaseExceptionId = USART0_IRQn + 16;
    uint32_t       interruptSource = getCurrentlyExecutingExceptionNumber();
    uint32_t       currentUartExceptionId;

    currentUartExceptionId = uart0BaseExceptionId + Platform_CommUartIndex();
    return interruptSource == currentUartExceptionId;
}


void Platform_CommClearInterrupt(void)
{
    uint32_t interruptId;

    interruptId = __mriLpc43xxState.pCurrentUart->pUartRegisters->IIR;
    (void)interruptId;
}


int Platform_CommSharingWithApplication(void)
{
    return __mriLpc43xxState.flags & LPC43XX_UART_FLAGS_SHARE;
}

static int isManualBaudRate(void);
int Platform_CommShouldWaitForGdbConnect(void)
{
    return !isManualBaudRate() && !Platform_CommSharingWithApplication();
}

static int isManualBaudRate(void)
{
    return (int)(__mriLpc43xxState.flags & LPC43XX_UART_FLAGS_MANUAL_BAUD);
}


int Platform_CommIsWaitingForGdbToConnect(void)
{
    static const uint32_t autoBaudStarting = 1;

    if (!Platform_CommShouldWaitForGdbConnect())
        return 0;

    return (int)(__mriLpc43xxState.pCurrentUart->pUartRegisters->ACR & autoBaudStarting);
}


void Platform_CommPrepareToWaitForGdbConnection(void)
{
    static const uint32_t   autoBaudStart = 1;
    static const uint32_t   autoBaudModeForStartBitOnly = 1 << 1;
    static const uint32_t   autoBaudAutoRestart = 1 << 2;
    static const uint32_t   autoBaudValue = autoBaudStart | autoBaudModeForStartBitOnly | autoBaudAutoRestart;

    if (!Platform_CommShouldWaitForGdbConnect())
        return;

    __mriLpc43xxState.pCurrentUart->pUartRegisters->ACR = autoBaudValue;
}


static int hasHostSentDataInLessThan10Milliseconds(void);
static int isNoReceivedCharAndNoTimeout(void);
void Platform_CommWaitForReceiveDataToStop(void)
{
    while (hasHostSentDataInLessThan10Milliseconds())
    {
        Platform_CommReceiveChar();
    }
}

static int hasHostSentDataInLessThan10Milliseconds(void)
{
    uint32_t originalSysTickControlValue = getCurrentSysTickControlValue();
    uint32_t originalSysTickReloadValue = getCurrentSysTickReloadValue();
    start10MillisecondSysTick();

    while (isNoReceivedCharAndNoTimeout())
    {
    }

    setSysTickReloadValue(originalSysTickReloadValue);
    setSysTickControlValue(originalSysTickControlValue);

    return Platform_CommHasReceiveData();
}

static int isNoReceivedCharAndNoTimeout(void)
{
    return !Platform_CommHasReceiveData() && !has10MillisecondSysTickExpired();
}
